Сотрудники = Новый Массив;
Сотрудники.Добавить("Анджелина Джоли");
Сотрудники.Добавить("Мел Гибсон");
Сотрудники.Добавить("Рассел Кроу");

Сообщить(Сотрудники.Количество());      //  Количество() вернет длину массива
Сообщить(Сотрудники.ВГраница()); // ВГраница() вернет индекс последнего элемента массива
Сообщить(Сотрудники.Получить(2)); // Вернет значение элемента массива с индексом 2
Сообщить(Сотрудники.Найти("Рассел Кроу"))  //ищет в массиве по строке
Сотрудники.Удалить(1); //удаляет элемент массива по индексу, со сдвигом элементов.
Сотрудники.Вставить(1, "Джорж Клуни"); //добавляет элемент в массив с указанным индексом, со сдвигом остальных элементов
Сообщить(Сотрудники.Получить(1)); // Вернет значение элемента массива с индексом 1
