ОчиститьСообщения();

ДанныеСотрудника1 = Новый Структура("Фамилия, Возраст, Подразделение");

ДанныеСотрудника1.Фамилия = "Тищенко";
ДанныеСотрудника1.Возраст = 42;
ДанныеСотрудника1.Подразделение = "Информационные технологии";

ДанныеСотрудника2 = Новый Структура("Фамилия, Возраст, Подразделение");

ДанныеСотрудника2.Фамилия = "Курякин";
ДанныеСотрудника2.Возраст = 34;
ДанныеСотрудника2.Подразделение = "Отдел кадров";

 Для каждого ЯчейкаДанных Из ДанныеСотрудника1 Цикл
	Сообщить(ЯчейкаДанных.Ключ + "=" + ЯчейкаДанных.Значение);
КонецЦикла;