ОчиститьСообщения();

ТаблицаСотрудников = Новый ТаблицаЗначений;

Колонки = ТаблицаСотрудников.Колонки;

Колонки.Добавить("Фамилия");
Колонки.Добавить("Оклад", Новый ОписаниеТипов("Число"));

СтрокаСотрудника = ТаблицаСотрудников.Добавить();
СтрокаСотрудника.Фамилия = "Короленко";
СтрокаСотрудника.Оклад = 30000;

СтрокаСотрудника = ТаблицаСотрудников.Добавить();
СтрокаСотрудника[0] = "Ищенко"; //фамилия
СтрокаСотрудника[1] = "35000"; //Оклад

Сообщить("Итог по колонке оклад : " + ТаблицаСотрудников.Итог("Оклад"));
